Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresSettings.GetAdvancedOption Method
Overload List
Name | Description
GetAdvancedOption(String, Boolean)
 Returns the value of an advanced option variable.
GetAdvancedOption(String, Double)
 Returns the value of an advanced option variable.
GetAdvancedOption(String, Int32)
 Returns the value of an advanced option variable.
GetAdvancedOption(String, String)
 Returns the value of an advanced option variable.
Top
See Also
Reference
TeklaStructuresSettings Class
Tekla.Structures Namespace